// This example displays a marker at the center of Australia.
// When the user clicks the marker, an info window opens.

function initMap() {
    
  var centerPoint = {
    position: { lat: 47.2722793, lng: 39.3422999 },
    zoom: 10    
  };

  var tooltip = {
    width: 500,
    height: 400
  }

  var markers = [
    {
      position: { lat: 47.2247093, lng: 39.7283837 },
      title: 'Главный корпус ЮФУ',
      panorana: '!1m0!3m2!1sru!2sru!4v1480967643877!6m8!1m7!1sqwk1360SXdwAAAQvPGGJsA!2m2!1d47.22470929672553!2d39.72838366510337!3f134!4f0!5f0.7820865974627469'
    },
    {       
      position: { lat: 47.226778, lng: 39.7267817 },
      title: 'Институт филологии журналистики и межкультурной коммуникации ЮФУ',
      panorana: '!1m0!3m2!1sru!2sru!4v1480966916664!6m8!1m7!1s8-axNTfRjLgAAAQvPGgYpg!2m2!1d47.22677795222104!2d39.72678173872873!3f69.63!4f-0.9399999999999977!5f0.7820865974627469'
    },
    {      
      position: { lat: 47.2271368, lng: 39.7258221 },
      title: "Институт филологии журналистики и межкультурной коммуникации (корпус на Пушкинской) ЮФУ",
      panorana: "!1m0!3m2!1sru!2sru!4v1480971103704!6m8!1m7!1s9wIl4QgBBjoAAAQvPGgYsg!2m2!1d47.22713680202239!2d39.72582207193307!3f68.62!4f-1.269999999999996!5f0.7820865974627469"
    },
    {
      position: { lat: 47.2277134, lng: 39.7281206 },
      title: "Институт социологии и регионоведения ЮФУ",
      panorana: "!1m0!3m2!1sru!2sru!4v1480971279192!6m8!1m7!1sZJlgNEsFaJMAAAQvPGuZSg!2m2!1d47.22771343803903!2d39.72812060274885!3f276.18!4f-1.3799999999999955!5f0.7820865974627469"
    },
    {
      position: { lat: 47.2227468, lng: 39.7188637 },
      title: "Открытый институт современных образовательных технологий ЮФУ «Буревестник»",
      panorana: "!1m0!3m2!1sru!2sru!4v1480971516869!6m8!1m7!1sKGj38jK_QFIAAAQvPGvbuA!2m2!1d47.22274680913279!2d39.71886368953847!3f80.21!4f3.8799999999999955!5f0.7820865974627469"
    },    
    {
      position: { lat: 47.2196777, lng: 39.7045372 },
      title: "Институт истории и международных отношений",
      panorana: "!1m0!3m2!1sru!2sru!4v1481056628242!6m8!1m7!1sKeJoWcVcIIAAAAQvPG8Q2A!2m2!1d47.21967766385519!2d39.7045372060594!3f254!4f0!5f0.7820865974627469"
    },
    {
      position: { lat: 47.2305916, lng: 39.6597636 },
      title: "Ботанический сад ЮФУ",
      panorana: "!1m0!3m2!1sru!2sru!4v1481056783719!6m8!1m7!1sNH6mKBlvZG0AAAQ1mGY-YQ!2m2!1d47.23059164260803!2d39.65976359545539!3f79!4f0!5f0.7820865974627469"
    },
    {
      position: { lat: 47.2244433, lng: 39.703101 },
      title: "Академия архитектуры и искусств ЮФУ",
      panorana: "!1m0!3m2!1sru!2sru!4v1481057094985!6m8!1m7!1sJke_Gfbw308AAAQ1mQDOJA!2m2!1d47.22444334540786!2d39.70310097266508!3f68.26!4f-4.849999999999994!5f0.7820865974627469"
    }, 
    {
      position: { lat: 47.2228242, lng: 39.7060258 },
      title: "Академия архитектуры и искусств ЮФУ",
      panorana: "!1m0!3m2!1sru!2sru!4v1481057343303!6m8!1m7!1sQPP6YdYpoEYAAAQ1mV-3xg!2m2!1d47.22282421923151!2d39.70602579211459!3f153.81!4f-2.3499999999999943!5f0.7820865974627469"
    },
    {
      position: { lat: 47.2457766, lng: 39.711383 },
      title: "Академия психологии и педагогики",
      panorana: "!1m0!3m2!1sru!2sru!4v1481057565903!6m8!1m7!1sEG7L3eKuRZoAAAQ1mWU6XQ!2m2!1d47.24577662620217!2d39.71138295577089!3f309.07!4f-8.459999999999994!5f0.7820865974627469"
    },
    {
      position: { lat: 47.2254702, lng: 39.7097184 },
      title: "Юридический факультет",
      panorana: "!1m0!3m2!1sru!2sru!4v1481057922406!6m8!1m7!1s6aGOxzZBPYMAAAQ1mWAIGA!2m2!1d47.22547015085663!2d39.7097183676417!3f91!4f0!5f0.7820865974627469"
    },
    {
      position: { lat: 47.2255905, lng: 39.7674077 },
      title: "Высшая школа бизнеса",
      panorana: "!1m0!3m2!1sru!2sru!4v1481058008940!6m8!1m7!1sTbAXbs5sxEgAAAQ1mowCRw!2m2!1d47.22559053857041!2d39.76740768139598!3f61.64!4f1.8700000000000045!5f0.7820865974627469"
    },
    {
      position: { lat: 47.2251022, lng: 39.7672936 },
      title: "Лицей ЮФУ",
      panorana: "!1m0!3m2!1sru!2s!4v1481058214204!6m8!1m7!1sJYnkti9O-QYAAAQ1mouGEA!2m2!1d47.22510219994879!2d39.767293573654!3f12.36!4f-1.1500000000000057!5f0.7820865974627469"
    }, 
    {
      position: { lat: 47.2862949, lng: 39.759229 },
      title: "Академия физической культуры и спорта",
      panorana: "!1m0!3m2!1sru!2sru!4v1481058590302!6m8!1m7!1sledQwAzlm4EAAAQ1sCr0Dw!2m2!1d47.28629493460428!2d39.75922899979923!3f120.07!4f-0.5999999999999943!5f0.7820865974627469"
    },   
    {
      position: { lat: 47.2854122, lng: 39.7593056 },
      title: "Академия психологии и педагогики. Корпус на Днепровском",
      panorana: "!1m0!3m2!1sru!2sru!4v1481058680844!6m8!1m7!1sU9WIZL6Gl-sAAAQ1sCxh7A!2m2!1d47.28541218600674!2d39.75930556595745!3f335.19!4f-1.4000000000000057!5f0.7820865974627469"
    },
    {
      position: { lat: 47.2858033, lng: 39.7589713 },
      title: "Институт философии и социально-политических наук",
      panorana: "!1m0!3m2!1sru!2s!4v1481058820806!6m8!1m7!1svCyj5rI3x98AAAQ1t0SDlQ!2m2!1d47.28580328242298!2d39.75897131453405!3f143.63!4f-1.4399999999999977!5f0.7820865974627469"
    },
    {
      position: { lat: 47.2865327, lng: 39.7581405 },
      title: "Общежитие РГПУ ЮФУ № 1",
      panorana: "!1m0!3m2!1sru!2sru!4v1481058933317!6m8!1m7!1sY5AuBJpM6B4AAAQ1sCu87Q!2m2!1d47.28653269106207!2d39.75814047306699!3f109.04!4f2.6200000000000045!5f0.7820865974627469"
    },
    {
      position: { lat: 47.2141793, lng: 39.6308836 },
      title: "НИИ Физики",
      panorana: "!1m0!3m2!1sru!2sru!4v1481059022076!6m8!1m7!1siWKyM0yaSYgAAAQ1t0cqEg!2m2!1d47.21417934505151!2d39.63088364595547!3f260.68!4f2.0400000000000063!5f0.7820865974627469" 
    },
    {
      position: { lat: 47.2152384, lng: 39.6350604 },
      title: "Комбинат питания ЮФУ",
      panorana: "!1m0!3m2!1sru!2s!4v1481059897851!6m8!1m7!1se5bREIiPyoEAAAQ1t0ck9g!2m2!1d47.21523837749873!2d39.6350603939128!3f338.15!4f6!5f0.7820865974627469" 
    },
    {
      position: { lat: 47.2138177, lng: 39.6290393 },
      title: "Типография ЮФУ Издательско-полиграфический комплекс КИБИ МЕДИА ЦЕНТРА",
      panorana: "!1m0!3m2!1sru!2s!4v1481059990896!6m8!1m7!1s_zOw2iGLdgkAAAQ1t0ht1w!2m2!1d47.21381770461805!2d39.62903931461472!3f144!4f0!5f0.7820865974627469" 
    },
    {
      position: { lat: 47.2147833, lng: 39.6299291 },
      title: "Академия биологии и биотехнологии ЮФУ",
      panorana: "!1m0!3m2!1sru!2sru!4v1481060095873!6m8!1m7!1snL3_EvkGJYMAAAQ1t0hu1Q!2m2!1d47.21478329071682!2d39.62992907987746!3f208.54!4f-8.739999999999995!5f0.7820865974627469" 
    },
    {
      position: { lat: 47.2173047, lng: 39.634208 },
      title: "Институт науки о Земле",
      panorana: "!1m0!3m2!1sru!2s!4v1481060196949!6m8!1m7!1sz7gUgPC5DZgAAAQ1y8nPqA!2m2!1d47.21730473495697!2d39.6342080336974!3f276.3!4f2.0799999999999983!5f0.7820865974627469" 
    },
    {
      position: { lat: 47.2230566, lng: 39.628162 },
      title: "Западный кампус",
      panorana: "!1m0!3m2!1sru!2s!4v1481060299406!6m8!1m7!1sJ2RBZXOGKacAAAQ10VRlKQ!2m2!1d47.22305664826873!2d39.62816289809735!3f84.62614379935776!4f-6.766883891299017!5f0.7820865974627469" 
    },
    {
      position: { lat: 47.2241665, lng: 39.6290438 },
      title: "КИБИ МЕДИА ЦЕНТР в Западном кампусе",
      panorana: "!1m0!3m2!1sru!2s!4v1481060388829!6m8!1m7!1sZDvB3v7PjrIAAAQ1y9iqdA!2m2!1d47.22443585898056!2d39.62846746837783!3f344.62!4f-0.1700000000000017!5f0.7820865974627469" 
    },
    {
      position: { lat: 47.2170946, lng: 39.6317489 },
      title: "Химический факультет",
      panorana: "!1m0!3m2!1sru!2sru!4v1481060468425!6m8!1m7!1sPga8vEPnctEAAAQvPISpDA!2m2!1d47.21709457207635!2d39.63174886384991!3f228.44!4f10.420000000000002!5f0.7820865974627469" 
    },
    {
      position: { lat: 47.2018319, lng: 38.935765 },
      title: "Учебный военный центр",
      panorana: "!1m0!3m2!1sru!2s!4v1481060680191!6m8!1m7!1sxb6kvswROAYAAAQvvJn_xQ!2m2!1d47.20183188640993!2d38.93576503827615!3f177.08!4f-4.390000000000001!5f0.7820865974627469" 
    },
    {
      position: { lat: 47.2048385, lng: 38.9444036 },
      title: "Институт нанотехнологий, электроники и приборостроения",
      panorana: "!1m0!3m2!1sru!2s!4v1481060773556!6m8!1m7!1sDuYktQt7irUAAAQvvJGlcw!2m2!1d47.20483848151955!2d38.94440358877023!3f46!4f0!5f0.7820865974627469" 
    },
    {
      position: { lat: 47.2051381, lng: 38.9441508 },
      title: "Институт радиотехнических систем и управления. Корпус на Шевченко",
      panorana: "!1m0!3m2!1sru!2s!4v1481060856416!6m8!1m7!1scxLIefkxlUsAAAQvvJIK-g!2m2!1d47.20513808733162!2d38.94415081049237!3f7.25!4f-0.12999999999999545!5f0.7820865974627469" 
    },
    {
      position: { lat: 47.2020536, lng: 38.9348284 },
      title: "Зал Ученого Совета, атриум",
      panorana: "!1m0!3m2!1sru!2s!4v1481061015939!6m8!1m7!1sIAzVH3RiabsAAAQvvJIKPA!2m2!1d47.20205364740342!2d38.93482842591936!3f3!4f0!5f0.7820865974627469" 
    },
    {
      position: { lat: 47.2055572, lng: 38.9397515 },
      title: "Библиотека ЮФУ. Здание в Таганроге",
      panorana: "!1m0!3m2!1sru!2s!4v1481061305366!6m8!1m7!1sLAKT097z8QUAAAQvPIS-7w!2m2!1d47.20555716411528!2d38.93975145084812!3f137.05!4f-0.5799999999999983!5f0.7820865974627469" 
    },
    {
      position: { lat: 47.2059258, lng: 38.9391253 },
      title: "Студенческий клуб ЮФУ в Таганроге",
      panorana: "!1m0!3m2!1sru!2s!4v1481061500916!6m8!1m7!1sIIyxjSqAPKwAAAQvvJlrvg!2m2!1d47.20592578542071!2d38.93912527524799!3f20.49!4f-5.310000000000002!5f0.7820865974627469" 
    },
    {
      position: { lat: 47.2154063, lng: 39.6293078 },
      title: "НИИ ФОХ",
      panorana: "!1m0!3m2!1sru!2s!4v1481062043069!6m8!1m7!1sWxQddJWkOsMAAAQvvKQI8g!2m2!1d47.21555734114187!2d39.62954231996059!3f307.95!4f-3.8799999999999955!5f0.7820865974627469" 
    },
    {
      position: { lat: 47.2153392, lng: 39.6325007 },
      title: "Физический факультет",
      panorana: "!1m0!3m2!1sru!2s!4v1481062043069!6m8!1m7!1sWxQddJWkOsMAAAQvvKQI8g!2m2!1d47.21555734114187!2d39.62954231996059!3f307.95!4f-3.8799999999999955!5f0.7820865974627469" 
    },
    {
      position: { lat: 47.2020485, lng: 38.9349261 },
      title: "Институт управления в экономических, экологических и социальных системах ЮФУ",
      panorana: "!1m0!3m2!1sru!2s!4v1481062215270!6m8!1m7!1svO52oGTua3cAAAQvvJGlWA!2m2!1d47.20204851936759!2d38.93492608272845!3f230!4f0!5f0.7820865974627469" 
    },
    {
      position: { lat: 47.2030604, lng: 38.9345263 },
      title: "Институт радиотехнических систем и управления ЮФУ (ИРТСУ ЮФУ)",
      panorana: "!1m0!3m2!1sru!2sru!4v1481062418840!6m8!1m7!1sIAPLPT7nwUUAAAQvvMLANg!2m2!1d47.20305685047459!2d38.93420411636805!3f178!4f0!5f0.7820865974627469" 
    }
  ];


  var map = new google.maps.Map(document.getElementById('map'), {
    zoom: centerPoint.zoom,
    center: centerPoint.position
  });
  var markerIcon = "img/bigcity.png";

  markers.forEach(function(mark) {
    var panoranaContent = '<iframe src="https://www.google.com/maps/embed?pb=' + mark.panorana +
      '" width=' + tooltip.width + ' height='+ tooltip.height +' frameborder="0" style="border:0" allowfullscreen></iframe>';

    var infowindow = new google.maps.InfoWindow({
      content: panoranaContent
    });

   
    var marker = new google.maps.Marker({
        position: mark.position,
        map: map,
        title: mark.title,
        icon: markerIcon
    });

    marker.addListener('click', function() {
        infowindow.open(map, marker);
    });
  })

}